Tekla.Structures.Model.ISharingEvents
Provides events related to the sharing service in a shared model environment.

Tekla.Structures.Model.ISharingEvents.SharedModelStateChanged
Occurs when the sharing service state changes.